Just a heads up: i've come across a test failure pertaining to the order of `instance_types` configured vs. returned from the API (will investigate shortly)
```
------- Stdout: -------
=== RUN   TestAccEKSNodeGroup_InstanceTypes_multiple
=== PAUSE TestAccEKSNodeGroup_InstanceTypes_multiple
=== CONT  TestAccEKSNodeGroup_InstanceTypes_multiple
    node_group_test.go:285: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # aws_eks_node_group.test must be replaced
        -/+ resource "aws_eks_node_group" "test" {
              ~ ami_type               = "AL2_x86_64" -> (known after apply)
              ~ arn                    = "arn:aws:eks:us-west-2:*******:nodegroup/tf-acc-test-7522170719420147764/tf-acc-test-7522170719420147764/64be8539-e106-834b-23e2-55faaba1e52e" -> (known after apply)
              ~ capacity_type          = "ON_DEMAND" -> (known after apply)
              ~ disk_size              = 20 -> (known after apply)
              ~ id                     = "tf-acc-test-7522170719420147764:tf-acc-test-7522170719420147764" -> (known after apply)
              ~ instance_types         = [
                  - "t2.medium",
                    "t3.large",
                    "t3.medium",
                  + "t2.medium",
                    "t2.large",
                ]
              + node_group_name_prefix = (known after apply)
              ~ release_version        = "1.21.4-20211013" -> (known after apply)
              ~ resources              = [
                  - {
                      - autoscaling_groups              = [
                          - {
                              - name = "eks-tf-acc-test-7522170719420147764-64be8539-e106-834b-23e2-55faaba1e52e"
                            },
                        ]
                      - remote_access_security_group_id = ""
                    },
                ] -> (known after apply)
              ~ status                 = "ACTIVE" -> (known after apply)
              ~ tags_all               = {} -> (known after apply)
              ~ version                = "1.21" -> (known after apply)
                # (4 unchanged attributes hidden)
        
        
              ~ update_config {
                  ~ max_unavailable            = 1 -> (known after apply)
                  ~ max_unavailable_percentage = 0 -> (known after apply)
                }
                # (1 unchanged block hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
    testing_new.go:70: Error running post-test destroy, there may be dangling resources: exit status 1
        
        Error: Error deleting VPC: DependencyViolation: The vpc 'vpc-0f0d760e484a322a4' has dependencies and cannot be deleted.
        	status code: 400, request id: 58925730-e376-40ea-86c7-01347bf2e1bc
        
        
--- FAIL: TestAccEKSNodeGroup_InstanceTypes_multiple (1534.42s)
```